/*
    암묵적 형변환
*/

/*
    문자열 타입으로 형변환
    - + 연산자를 사용할 때 좌항과 우항 중 하나라도 문지열이 존재하면 문자열이 나닌 항을 문자열로 변경하여 연결 연산함
*/
console.log(1+'1');


console.log('==============================');

/*
    숫자 타입으로 형변환
    - + 연산자를 제외한 나머지 산술 연산 혹은 대소 비교 연산에 대하여 좌, 우항 중 하나라도 숫자가 존재하면 숫자가 아닌 항을 숫자 타입으로 변경하여 연산
*/
console.log('1' - 0)


console.log('==============================');

/*
    불리언 타입으로 형변환
    - 
*/



console.log('==============================');

/*
    명시적 형변환
*/

/*
    문자열 타입으로 형변환
    - 
    - 
*/



console.log('==============================');

/*
    숫자 타입으로 형변환
    - 
    - 
*/



console.log('==============================');

/*
    불리언 타입으로 형변환
    - 
    - 
*/



console.log('==============================');

/*
    단축 평가 
    - 
    - 
    - 
    - 
    - 
*/


